Repository: Abdulaziz-Alshehri1/Health-App-Final-Project
Catalog: Health/Health/*.lproj/Localizable.strings
Languages: ar

source: Keto
ar: كيتو

# desc-1
source: The ketogenic diet is a very low carb, high fat diet that shares many similarities with the Atkins and low carb diets. It involves drastically reducing carbohydrate intake and replacing it with fat. This reduction in carbs puts your body into a metabolic state called ketosis.
ar: النظام الغذائي الكيتون هو نظام غذائي منخفض الكربوهيدرات وعالي الدهون يتشابه في العديد من أوجه التشابه مع حمية أتكنز والأنظمة الغذائية منخفضة الكربوهيدرات. وهو يتضمن التقليل بشكل كبير من تناول الكربوهيدرات واستبدالها بالدهون. وهذا الانخفاض في الكربوهيدرات يضع الجسم في حالة استقلابية تسمى الكيتوزية .

source: DASH
ar: داش

# desc-2
source: The DASH diet is rich in vegetables, fruits and whole grains. It includes fat-free or low-fat dairy products, fish, poultry, beans and nuts. It limits foods that are high in saturated fat, such as fatty meats and full-fat dairy products.
ar: نظام DASH الغذائي غني بالخضروات والفواكه والحبوب الكاملة. ويشمل منتجات الألبان الخالية من الدهون أو قليلة الدسم والأسماك والدواجن والفاصوليا والمكسرات. ويحد من الأطعمة التي تحتوي على نسبة عالية من الدهون المشبعة ، مثل اللحوم الدهنية والمليئة بالدهون. - منتجات الألبان الدهنية

source: MIND
ar: مايند

# desc-3
source: MIND stands for the Mediterranean-DASH Intervention for Neurodegenerative Delay.The MIND diet aims to reduce dementia and the decline in brain health that often occurs as people get older. It combines aspects of two very popular diets, the Mediterranean diet and the Dietary Approaches to Stop Hypertension (DASH) diet.Many experts regard the Mediterranean and DASH diets as some of the healthiest. Research has shown they can lower blood pressure and reduce the risk of heart disease, diabetes and several other diseases (1Trusted Source, 2Trusted Source, 3Trusted Source, 4Trusted Source).But researchers wanted to create a diet specifically to help improve brain function and prevent dementia.To do this, they combined foods from the Mediterranean and DASH diets that had been shown to benefit brain health.For example, both the Mediterranean and DASH diets recommend eating a lot of fruit. Fruit intake has not been correlated with improved brain function, but eating berries has been (5Trusted Source, 6Trusted Source).Thus, the MIND diet encourages its followers to eat berries, but does not emphasize consuming fruit in general.Currently, there are no set guidelines for how to follow the MIND diet. Simply eat more of the 10 foods the diet encourages you to eat, and eat less of the five foods the diet recommends you limit.
ar: مايند تعني تدخل البحر الأبيض المتوسط ​​للتأخير التنكسي العصبي. يهدف نظام مايند الغذائي إلى تقليل الخرف وتدهور صحة الدماغ الذي يحدث غالبًا مع تقدم الناس في السن. ويجمع بين جوانب من نظامين شائعين للغاية ، حمية البحر الأبيض المتوسط ​​والنهج الغذائية نظام غذائي لوقف ارتفاع ضغط الدم (DASH): يعتبر العديد من الخبراء أن حمية البحر الأبيض المتوسط ​​و DASH من أكثر الأنظمة الغذائية صحة ، وقد أظهرت الأبحاث أنها يمكن أن تخفض ضغط الدم وتقليل مخاطر الإصابة بأمراض القلب والسكري والعديد من الأمراض الأخرى (1 مصدر موثوق ، 2 مصدر موثوق ، 3 مصدر موثوق ، 4 مصدر موثوق) ، لكن الباحثين أرادوا إنشاء نظام غذائي خاص للمساعدة في تحسين وظائف المخ والوقاية من الخرف ، للقيام بذلك ، قاموا بدمج الأطعمة من حمية البحر الأبيض المتوسط ​​و DASH التي ثبت أنها تفيد صحة الدماغ ، على سبيل المثال ، كلاهما توصي حمية البحر الأبيض المتوسط ​​و DASH بتناول الكثير من الفاكهة. لم يتم ربط تناول الفاكهة بتحسين وظائف المخ ، ولكن تناول التوت كان (5). المصدر ، 6 مصدر موثوق) ، وبالتالي ، فإن حمية مايند تشجع أتباعها على تناول التوت ، لكنها لا تركز على تناول الفاكهة بشكل عام ، في الوقت الحالي ، لا توجد إرشادات محددة لكيفية اتباع حمية مايند الغذائية. ما عليك سوى تناول المزيد من الأطعمة العشرة التي يشجعك النظام الغذائي على تناولها ، وتقليل تناول الأطعمة الخمسة التي يوصي النظام الغذائي بالحد منها

# TLC Diet
source: TLC
ar: تي إل سي

# desc-4
source: This diet has been reviewed by U.S. News' team of expert panelists. LEARN MOREThe TLC (Therapeutic Lifestyle Changes) diet was created by the National Institute of Health’s National Cholesterol Education Program with the goal of cutting cholesterol as part of a heart-healthy eating regimen.It calls for eating plenty of veggies, fruits, breads, cereals and pasta and lean meats. The guidelines are broad enough that you’ll have a lot of latitude with what you eat.
ar: تمت مراجعة هذا النظام الغذائي من قبل فريق الخبراء المتخصصين في US News. اعرف المزيد تم إنشاء نظام TLC (تغييرات نمط الحياة العلاجية) بواسطة البرنامج الوطني لتعليم الكوليسترول التابع للمعهد الوطني للصحة بهدف خفض الكوليسترول كجزء من غذاء صحي للقلب النظام. إنه يدعو إلى تناول الكثير من الخضار والفواكه والخبز والحبوب والمعكرونة واللحوم الخالية من الدهون. الإرشادات واسعة بما يكفي بحيث يكون لديك الكثير من الحرية مع ما تأكله

source: intermittent fasting
ar: الصيام المتقطع

# desc-5
source: Many diets focus on what to eat, but intermittent fasting is all about when you eat.With intermittent fasting, you only eat during a specific time. Fasting for a certain number of hours each day or eating just one meal a couple days a week, can help your body burn fat. And scientific evidence points to some health benefits, as well.Johns Hopkins neuroscientist Mark Mattson, Ph.D., has studied intermittent fasting for 25 years. He says that our bodies have evolved to be able to go without food for many hours, or even several days or longer. In prehistoric times, before humans learned to farm, they were hunters and gatherers who evolved to survive — and thrive — for long periods without eating. They had to: It took a lot of time and energy to hunt game and gather nuts and berries.Even 50 years ago, it was easier to maintain a healthy weight. Johns Hopkins dietitian Christie Williams, M.S., R.D.N., explains: “There were no computers, and TV shows turned off at 11 p.m.; people stopped eating because they went to bed. Portions were much smaller. More people worked and played outside and, in general, got more exercise.”Nowadays, TV, the internet and other entertainment are available 24/7. We stay awake for longer hours to catch our favorite shows, play games and chat online. We’re sitting and snacking all day — and most of the night.”Extra calories and less activity can mean a higher risk of obesity, type 2 diabetes, heart disease and other illnesses. Scientific studies are showing that intermittent fasting may help reverse these trends.
ar: تركز العديد من الأنظمة الغذائية على ما نأكله ، ولكن الصيام المتقطع هو كل شيء يتعلق بوقت تناول الطعام. مع الصيام المتقطع ، لا تأكل إلا خلال وقت معين. الصيام لعدد معين من الساعات كل يوم أو تناول وجبة واحدة فقط بضعة أيام في الأسبوع يمكن أن يساعد جسمك على حرق الدهون. وتشير الأدلة العلمية إلى بعض الفوائد الصحية أيضًا. عالم الأعصاب بجامعة جونز هوبكنز مارك ماتسون ، دكتوراه ، درس الصيام المتقطع لمدة 25 عامًا. يقول أن أجسامنا قد تطورت لتكون قادرة على البقاء بدون طعام لعدة ساعات ، أو حتى عدة أيام أو أكثر. في عصور ما قبل التاريخ ، قبل أن يتعلم البشر الزراعة ، كانوا صيادين وجامعي الثمار تطوروا للبقاء على قيد الحياة - والازدهار - لفترات طويلة دون تناول الطعام. كان عليهم: الكثير من الوقت والطاقة لاصطياد اللعبة وجمع المكسرات والتوت. حتى قبل 50 عامًا ، كان من الأسهل الحفاظ على وزن صحي. توضح أخصائية التغذية بجامعة جونز هوبكنز كريستي ويليامز ، MS ، RDN: التلفزيونية في الساعة 11 مساءً ؛ توقف الناس عن تناول الطعام جي لأنهم ذهبوا إلى الفراش. كانت الأجزاء أصغر بكثير. يعمل المزيد من الأشخاص ويلعبون في الخارج ، وبشكل عام ، يمارسون المزيد من التمارين. في الوقت الحاضر ، يتوفر التلفزيون والإنترنت وغيرها من وسائل الترفيه على مدار الساعة طوال أيام الأسبوع. نبقى مستيقظين لساعات أطول لمشاهدة برامجنا المفضلة ولعب الألعاب والدردشة عبر الإنترنت. نحن نجلس ونتناول وجبات خفيفة طوال اليوم - ومعظم الليل. يمكن أن تعني السعرات الحرارية الزائدة والنشاط الأقل ارتفاعًا في خطر الإصابة بالسمنة ومرض السكري من النوع 2 وأمراض القلب وأمراض أخرى. تظهر الدراسات العلمية أن الصيام المتقطع قد يساعد في عكس هذه الاتجاهات

source: Green tea noodles with sticky sweet chilli salmon
ar: سلمون بالمكرونة الخضراء

# Desc-1
source: Preheat oven to 220°C. Heat peanut oil in a small saucepan over low heat. Add ginger, long green shallot, lemongrass and a pinch of salt. Cook, stirring occasionally, for 6-8 minutes until long green shallot is very soft but not coloured. Remove from heat and cool.Meanwhile, combine honey, olive oil and chilli paste in a bowl. Stir to combine. Line a baking tray with baking paper and add salmon. Rub honey mixture over salmon to coat, then season. Roast for 12-15 minutes for medium. Set aside, loosely covered with foil, to rest for 5 minutes.Cook noodles according to packet instructions. Drain and rinse briefly with warm water.Whisk lime juice, sugar, fish sauce and chilli flakes into the shallot oil mixture. Place noodles in a large bowl with three quarters of the shallot oil, season and toss to combine. Arrange on a serving platter and flake salmon over the top. Drizzle over remaining shallot oil and scatter with extra chilli flakes, toasted sesame seeds and shiso leaves. Serve at room temperature or chilled.
ar: سخني الفرن إلى 220 درجة مئوية. سخني زيت الفول السوداني في قدر صغيرة على نار خفيفة. أضيفي الزنجبيل ، والكراث الأخضر الطويل ، وعشب الليمون ورشة ملح. اطبخي مع التحريك من حين لآخر لمدة 6-8 دقائق حتى يصبح الكراث الأخضر طريًا جدًا. لكن غير ملون ، يرفع عن النار ويبرد ، وفي الوقت نفسه ، يُمزج العسل وزيت الزيتون ومعجون الفلفل الحار في وعاء ويقلب حتى يتجانس ، ويُبطن صينية الخبز بورق الخبز ويُضاف السلمون ، ويُفرك مزيج العسل فوق السلمون لتغلفه ، ثم يتبل. تحمص لمدة 12-15 دقيقة متوسطة ، اتركها جانباً ، مغطاة برقائق معدنية ، لتستريح لمدة 5 دقائق. اطبخ النودلز حسب التعليمات على العبوة. صفيها واشطفها لفترة وجيزة بالماء الدافئ. يخفق عصير الليمون والسكر وصلصة السمك ورقائق الفلفل الحار في مزيج زيت الكراث. ضعي المعكرونة في وعاء كبير مع ثلاثة أرباع زيت الكراث ، وتبليها وقلبي حتى تمتزج. رتبيها على طبق التقديم وقومي بتقطير السلمون فوقها. رشي فوقها زيت الكراث المتبقي وانشريها برقائق فلفل حار محمصة بذور السمسم وأوراق الشيزو ، تُقدم في ريال عماني أوم درجة الحرارة أو مبردة

source: Lemon chicken
ar: صدور الدجاج بالليمون

# Desc-2
source: Mix the cornflour with the soy sauce and lemon juice in a small bowl. 2. Heat the oil in a large frying pan or wok over a high heat, add the chicken, capsicum, carrot and broccoli and stir-fry for 2–3 minutes, or until the chicken is lightly browned and the vegetables are beginning to soften. 3. Pour the lemon and soy mixture into the pan, add the chicken stock and spring onions and bring to a simmer. Reduce the heat and cook for 2 minutes, or until the sauce is slightly thickened and the chicken is cooked through, stirring regularl 4. Sprinkle with grated lemon zest and serve with rice.
ar: اخلطي دقيق الذرة مع صلصة الصويا وعصير الليمون في وعاء صغير. 2. سخني الزيت في مقلاة كبيرة أو مقلاة على نار عالية ، أضيفي الدجاج والفليفلة والجزر والبروكلي وقلبي لمدة 2-3 دقائق ، أو حتى ينضج الدجاج قليلاً وتبدأ الخضار في النضوج. 3. صبي خليط الليمون والصويا في المقلاة ، أضيفي مرقة الدجاج والبصل الأخضر واتركي المزيج على نار هادئة ، قللي النار واتركيها على نار هادئة لمدة دقيقتين ، أو حتى تتكاثف الصلصة قليلاً وينضج الدجاج تمامًا مع التحريك العادي 4 رشي قشر الليمون المبشور وقدميه مع الأرز

source: Tofu scramble with shredded cabbage and chilli sambal
ar: التوفو مع الملفوف والفلفل الاخضر

source: Sesame butter radishes with lemon
ar: الفجل مع الزبدة والسمسم والليمون

# Desc-4
source: Melt butter and oil in large frypan over medium-high heat and cook for 3 minutes or until nut brown. Add radish and cook, tossing pan, for 6-8 minutes or until tender. Spoon into a serving bowl. 2. Drizzle over lemon juice and scatter with sesame seeds and salad leaves. Serve with sourdough and extra lemon.
ar: تُذوّب الزبدة والزيت في مقلاة كبيرة على نار متوسطة عالية ويُطهى لمدة 3 دقائق أو حتى يصبح لون الجوز بنيًا. يُضاف الفجل ويُطهى في المقلاة لمدة 6-8 دقائق أو حتى ينضج. ملعقة في وعاء التقديم. 2. يُسكب فوق عصير الليمون ويُرش ببذور السمسم وأوراق السلطة. تقدم مع العجين المخمر والليمون الإضافي.

source: Serve up a golden roasted chicken with this simple one-tray bake recipe
ar: الدجاج المشوي مع الخبز

# Desc-5
source: 1. Preheat the oven to 200C. 2. Combine the thyme, anchovies, oregano, chilli, oil, garlic and lemon zest in a bowl. Add the chicken and turn to coat. Add the potatoes and toss to combine. Place on a large baking tray and scatter over the speck. 3. Cut the zested lemon into wedges and add to the tray. Season and roast for 40 minutes or until chicken is golden and potatoes tender. Remove from the oven and top with tomatoes. Roast for a further 10-15 minutes until tomatoes are blistered. 4. Squeeze over roasted lemon juice to serve.
ar: 1. سخني الفرن إلى 200 درجة مئوية. 2. اخلطي الزعتر والأنشوجة والأوريغانو والفلفل الحار والزيت والثوم وقشر الليمون في وعاء. أضيفي الدجاج وقلبيه حتى يتغطى. أضيفي البطاطس وقلبي حتى يمتزج. صينية خبز كبيرة ووزعيها فوق البقعة 3. قطعي الليمون المبشور إلى شرائح وأضيفيها إلى الصينية ، تبليها وشويها لمدة 40 دقيقة أو حتى يصبح الدجاج ذهبي اللون وتنضج البطاطس. أخرجيها من الفرن وضعي فوقها الطماطم. 10-15 دقيقة أخرى حتى تتقرح الطماطم 4. اعصرها فوق عصير الليمون المحمص للتقديم

source: Rice salad with eggplant
ar: سلطة الارز مع الباذنجان

# Desc-6
source: Heat oil in a saucepan over medium heat. Add seeds and curry leaves. Cook for 2 minutes or until mustard seeds start to pop. Add the onion, ginger and two-thirds garlic. Cook 3-4 minutes until onion has softened. Add eggplant, curry powder and sugar. Cook 8-10 minutes until eggplant has softened slightly. 2. Stir in vinegar, half the tomatoes and 1 cup (250ml) water. Bring to the boil. Reduce heat to mediumlow and simmer, loosely covered, for 25 minutes or until eggplant is very tender. Stir in chickpeas and remaining tomatoes. 3. For the rice, combine all ingredients with 2 cups (500ml) cold water and 1 tsp salt flakes in a pan over high heat. Bring to the boil. Reduce heat to low, cover and cook, without stirring, for 12 minutes or until water has been absorbed and rice is tender. Uncover and stir with a fork. 4. For dressing, combine yoghurt, lemon juice and remaining garlic in a small bowl. 5. Place rice in a bowl. Top with eggplant and cucumber. Drizzle over dressing and scatter with mint. Toss to serve.
ar: سخني الزيت في قدر على نار متوسطة. أضيفي البذور وأوراق الكاري. اطهي لمدة دقيقتين أو حتى تبدأ بذور الخردل في الظهور. أضيفي البصل والزنجبيل وثلثي الثوم. اطبخي 3-4 دقائق حتى ينضج البصل. أضيفي الباذنجان ومسحوق الكاري والسكر.طهى لمدة 8-10 دقائق حتى ينضج الباذنجان قليلا 2. قلبي في الخل ونصف حبة طماطم وكوب (250 مل) من الماء واتركيها حتى الغليان.قللي الحرارة إلى متوسطة واتركيها على نار هادئة ، ومغطاة بشكل غير محكم ، لمدة 25 دقيقة أو حتى يصبح الباذنجان طريًا جدًا.قلب الحمص وبقية الطماطم .3 للأرز ، اخلطي جميع المكونات مع 2 كوب (500 مل) من الماء البارد و 1 ملعقة صغيرة من رقائق الملح في مقلاة على نار عالية. - خففي النار وغطّيه واطهيه دون تقليب لمدة 12 دقيقة أو حتى يمتص الماء ويصبح الأرز طريًا. انزعي الغطاء وقلّبي بواسطة شوكة. وعاء 5. ضعي الأرز في وعاء و ضعيه فوق الباذنجان و الخيار و رشي فوق الصلصة و انشري بالنعناع. إرم للخدمة

source: Summer chopped salad with citrus sesame dressing
ar: سلطة الصيف بصلصة السمسم

# Desc-7
source: Cut the corn cobs in half and simmer in a large pan of water for 8 minutes, then drain and cool. Cut off the kernels. 2. Heat a little olive oil in a hot pan, add the corn kernels and zucchini and cook until the zucchini is just starting to soften and colour. 3. Meanwhile, make the citrus sesame dressing. Whisk the garlic, tahini, tamari, vinegar and ponzu in a bowl. Slowly add the oils, whisking continuously until emulsified. Whisk in the wasabi and then stir in the eschalot. 4. To deep-fry the chickpeas, heat oil in a large heavy-based pan until a breadcrumb dropped in sizzles. Carefully add chickpeas and fry for 2 minutes, or until they start to blister. Drain in a bowl lined with paper towel. Season with the furikake while still hot and leave to cool completely. (You can store them in an airtight container for up to a day – they make an excellent snack.) 5. Arrange cabbage, cucumber, beetroot and lettuce in a bowl, add apple cider vinegar and toss well. Top with corn, zucchini and edamame. Drizzle over sesame dressing and finish with chickpeas, dill, parsley, spring onions and furikake.
ar: قطعي أكواز الذرة إلى نصفين واتركيها على نار هادئة في قدر كبير من الماء لمدة 8 دقائق ، ثم صفيها واتركيها تبرد. قطعي حبات الذرة. 2. سخني القليل من زيت الزيتون في مقلاة ساخنة ، أضيفي حبات الذرة والكوسا واتركيها حتى تنضج. بدأت الكوسا في التليين واللون. 3. في غضون ذلك ، حضري صلصة السمسم الحمضية. اخفقي الثوم والطحينة والتماري والخل والبونزو في وعاء. أضيفي الزيوت ببطء مع الخفق باستمرار حتى يتحلل. اخفقي في الوسابي و 4. لقلي الحمص ، سخني الزيت في مقلاة كبيرة ثقيلة القاعدة حتى تسقط فتات الخبز في أزيز ، أضيفي الحمص بحذر واقلي لمدة دقيقتين ، أو حتى تبدأ في التقرح. وعاء مبطّن بمنشفة ورقية. تبلي بالفوريكاكي وهو لا يزال ساخنًا واتركيه ليبرد تمامًا. (يمكنك تخزينها في وعاء محكم الغلق لمدة تصل إلى يوم واحد - فهي تعد وجبة خفيفة ممتازة.) 5. رتبي الكرنب والخيار والشمندر و يضاف الخس في وعاء ويضاف خل التفاح ويقلب جيدا. ادامامي. رشي فوق صلصة السمسم وانتهي بالحمص والشبت والبقدونس والبصل الأخضر والفوريكاكي.

source: Minty lamb with beetroot and charred broccoli
ar: اللحم مع الشمندر و القربيط

# Desc-8
source: Whiz the fresh mint, parsley, pine nuts, parmesan and garlic in a food processor until a paste. Gradually add 1/2 cup (125ml) oil and whiz until combined. Set aside. 2. Brush lamb with a little extra oil, then season and coat in dried mint. In a separate bowl, toss broccoli and 1 tbs oil. Preheat a chargrill pan to medium-high heat. 3. Cook broccoli, turning, for 3-4 minutes until lightly charred. Set aside. Cook lamb for 4 minutes each side for medium-rare or until cooked to your liking. 4. Whisk the lemon juice and remaining 1 tbs oil together in a bowl. Season. 5. Arrange broccoli, watercress, beetroot and feta on a platter. Top with the lamb, then drizzle over lemon dressing and mint pesto to serve.
ar: اخفقي النعناع الطازج والبقدونس والصنوبر والبارميزان والثوم في معالج الطعام حتى يتماسك. أضيفي تدريجياً 1/2 كوب (125 مل) الزيت واخفقي حتى يتجانس. اتركيه جانباً. 2. ادهني لحم الضأن بقليل من الزيت الإضافي ، ثم تبليها وغطيها بالنعناع المجفف ، في وعاء منفصل ، اخلطي البروكلي و 1 ملعقة كبيرة زيت ، سخني مقلاة شواء على حرارة متوسطة إلى عالية 3. اطبخي البروكلي مع التقليب لمدة 3-4 دقائق حتى يتفحم قليلاً ، اتركيه جانباً. لحم الضأن لمدة 4 دقائق لكل جانب للحصول على متوسط نادر أو حتى ينضج حسب رغبتك 4. اخفق عصير الليمون والباقي 1 ملعقة كبيرة زيت معًا في وعاء.تبل 5. رتب البروكلي والجرجير والشمندر والفيتا على طبق. مع لحم الغنم ، ثم نسكب فوق تتبيلة الليمون والبيستو بالنعناع للتقديم.
